Catalogs/НастройкиЧатовТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>НастройкиЧатовТелеграм</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПриемаСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗарегестрирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиЧатовТелеграм/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = ПустаяСтрока(Параметры.Ключ.УникальныйИдентификатор());
	
	ЗадатьИмяКаталога = ПустаяСтрока(Объект.ИмяПредопределенныхДанных)
			Или НовыйЭлемент;
	
	Элементы.ИмяКаталога.Доступность = ЗадатьИмяКаталога;

	НачальноеЗаполнениеИмениКаталога = Не ПустаяСтрока(Объект.ИмяПредопределенныхДанных)
		И ПустаяСтрока(Объект.ИмяКаталога);
	Если НачальноеЗаполнениеИмениКаталога Тогда
	
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		ТекущийОбъект.Заполнить(Неопределено);
		Объект.ИмяКаталога = ТекущийОбъект.ИмяКаталога;
		ТекущийОбъект.Записать();
	
	КонецЕсли;
	
	ПолучитьТокен();

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТокенИзменен Тогда
	
		Справочники.НастройкиЧатовТелеграм
			.ЗаписатьТокен(Объект.Ссылка, Токен);
		
		ТокенИзменен = Ложь;
	
	КонецЕсли;

	Токен = ?(ЗначениеЗаполнено(Токен), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры

&НаКлиенте
Процедура ТокенПриИзменении(Элемент)
	ТокенИзменен = Истина
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "АдресПриемаЗарегестрирован" Тогда
	
		Объект.АдресЗарегестрирован = Параметр;
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьТокен()
	
	Если Не Параметры.Ключ.Пустая() Тогда
	
		Токен = Справочники.НастройкиЧатовТелеграм
			.ПолучитьТокен(Объект.Ссылка);
	
	КонецЕсли;

	Токен = ?(ЗначениеЗаполнено(Токен), ЭтотОбъект.УникальныйИдентификатор, "");

КонецПроцедуры

#КонецОбласти
